--[[
for 标识符 = 表达式A，表达式B，表达式C do
	循环内容
end
1：将表达式A的结果赋值给标识符，进入2
2：根据C表达式的正负来和表达式B进行比较，如果
   C表达式的结果为正，那么比较就是用标识符<=
   表达式B，如果C表达式的结果为负，那么比较就
   是用标识符>=表达式B；如果为真就进入3；为假
   就跳出循环
3：执行循环内容，然后让标识符+=表达式3，最后进
   入2
4：如果省略表达式3，那么默认表达式3就是1
--]]
for i = 1, 10, 3 do
	print(i)
end
--[[
for (int i = 1; i <= 10; i += 3)
{
	print(i)
}
--]]
for i = 10, 1, -2 do
	print(i)
end
--[[
for (int i = 10; i >= 1; i += -2)
{
	print(i)
}
--]]

for i = 1, 10 do
	print(i)
end
--[[
for (int i = 1; i <= 10; ++i)
{
	print(i)
}
--]]

